// ===== 배관 위치도 설정 =====
const PIPELINE_SEGMENTS = [
  {
    "id": "p1",
    "name": "메인관",
    "site": "115정거장",
    "관경": "150A",
    "노출길이": 100,
    "color": "#facc15",
    "points": [
      [
        8,
        684
      ],
      [
        316,
        680
      ],
      [
        1553,
        715
      ],
      [
        2508,
        740
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p2",
    "name": "1.혜화",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 10,
    "color": "#facc15",
    "points": [
      [
        2013,
        717
      ],
      [
        2001,
        608
      ],
      [
        1978,
        600
      ],
      [
        1997,
        458
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p3",
    "name": "2.진천순대",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 15,
    "color": "#facc15",
    "points": [
      [
        1458,
        707
      ],
      [
        1481,
        503
      ],
      [
        1497,
        495
      ],
      [
        1493,
        443
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p4",
    "name": "3.온유담",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 15,
    "color": "#facc15",
    "points": [
      [
        1374,
        707
      ],
      [
        1390,
        555
      ],
      [
        1293,
        268
      ],
      [
        1291,
        210
      ],
      [
        1355,
        198
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p5",
    "name": "4.버거킹",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 15,
    "color": "#facc15",
    "points": [
      [
        1128,
        699
      ],
      [
        1122,
        540
      ],
      [
        1110,
        536
      ],
      [
        1089,
        377
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p6",
    "name": "5.고봉삼계탕",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 15,
    "color": "#facc15",
    "points": [
      [
        588,
        680
      ],
      [
        580,
        519
      ],
      [
        540,
        509
      ],
      [
        512,
        338
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p7",
    "name": "6.강남면옥",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 15,
    "color": "#facc15",
    "points": [
      [
        320,
        678
      ],
      [
        336,
        538
      ],
      [
        443,
        534
      ],
      [
        450,
        295
      ],
      [
        357,
        245
      ],
      [
        357,
        204
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p8",
    "name": "7.곰탕집",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 25,
    "color": "#facc15",
    "points": [
      [
        652,
        686
      ],
      [
        615,
        1080
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p9",
    "name": "8.우대포",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 25,
    "color": "#facc15",
    "points": [
      [
        1188,
        705
      ],
      [
        1194,
        897
      ],
      [
        1083,
        897
      ],
      [
        1085,
        985
      ],
      [
        1205,
        985
      ],
      [
        1209,
        1183
      ]
    ],
    "매달기구간": []
  },
  {
    "id": "p10",
    "name": "9.양촌리",
    "site": "115정거장",
    "관경": "80A",
    "노출길이": 25,
    "color": "#facc15",
    "points": [
      [
        1431,
        709
      ],
      [
        1444,
        942
      ],
      [
        1417,
        944
      ],
      [
        1421,
        998
      ]
    ],
    "매달기구간": []
  }
];

const VALVE_POSITIONS = [];

const MAP_LABELS = [
  {
    "id": "lb1781822513237",
    "text": "1.혜화",
    "x": 1828,
    "y": 390,
    "color": "#fef3c7"
  },
  {
    "id": "lb1781822516887",
    "text": "2.진천순대",
    "x": 1595,
    "y": 400,
    "color": "#fef3c7"
  },
  {
    "id": "lb1781822520354",
    "text": "3.온유담",
    "x": 1268,
    "y": 118,
    "color": "#fef3c7"
  },
  {
    "id": "lb1781822523141",
    "text": "4.버거킹",
    "x": 983,
    "y": 363,
    "color": "#fef3c7"
  },
  {
    "id": "lb1781822527858",
    "text": "5.고봉삼계탕",
    "x": 598,
    "y": 323,
    "color": "#fef3c7"
  },
  {
    "id": "lb1781822532451",
    "text": "6.강남면옥",
    "x": 433,
    "y": 193,
    "color": "#fef3c7"
  },
  {
    "id": "lb1781822536428",
    "text": "7.곰탕집",
    "x": 670,
    "y": 1175,
    "color": "#fef3c7"
  },
  {
    "id": "lb1781822541259",
    "text": "8.우대포",
    "x": 1140,
    "y": 1278,
    "color": "#fef3c7"
  },
  {
    "id": "lb1781822545631",
    "text": "9.양촌리",
    "x": 1568,
    "y": 1070,
    "color": "#fef3c7"
  }
];